<?php include ('header.php'); ?>
      <section class="ktsnpl">
         <div class="container">
            <h2 class="ktsnpl-title">КТС НПЛ</h2>
            <h3 class="ktsnpl-subtitle">Комплекс технических средств <span class="accent">непрограммируемой логики</span></h3>
            <div class="ktsnpl-block">
               <div class="ktsnpl-text">
                  <p class="ktsnpl-block__text">
                     <b>Комплекс технических средств</b> <span class="accent">непрограммируемой логики</span> (КТС НПЛ) —
                     предназначен для построения автоматизированных систем управления технологическими процессами (АСУ ТП), в
                     которых функция управления защищена от программных ошибок и киберугроз. Функция управления реализуется на
                     непрограммируемых средствах – «<b>жёсткой логике</b>». <br />
                     <br />

                     Современные АСУ ТП в подавляющем большинстве случаев реализуются на программируемых средствах. Для
                     программируемых систем характерны гибкость в реализации алгоритмов и возможность сложных вычислений,
                     компактность оборудования. Однако недостатки программируемых систем существенны: зависимость от ошибок
                     программистов и уязвимость для киберугроз.<br />
                     <br />

                     Комплекс технических средств непрограммируемой логики КТС НПЛ решает задачу ухода от недостатков
                     программируемой техники при сохранении её достоинств. Обработка сигналов, принятие решений и формирование
                     команд управления в КТС НПЛ реализованы полностью на непрограммируемых средствах «<b>жёсткой</b>» логике.
                  </p>
               </div>
               <img src="img/ktsnpl.jpg" alt="" class="ktsnpl-block__img" />
            </div>

            <div class="ktsnpl-block">
               <div class="ktsnpl-text">
                  <p class="ktsnpl-block__text">
                     <span class="accent">Сохранены достоинства</span>, характерные для программируемой <br />
                     техники
                  </p>
                  <ul class="ktsnpl-block__list">
                     <li class="ktsnpl-block__item">
                        Обработка сигналов, в том числе аналоговых, и процесс принятия решений реализован полностью на
                        непрограммируемых средствах, но в цифровой форме. Сложные операции над аналоговыми сигналами (линеаризация
                        сигналов от нелинейных датчиков и т.п.) выполнены заранее с высокой точностью и сохранены в
                        энергонезависимой памяти. Данный подход обеспечивает столь же высокую точность, как и в программируемых
                        решениях.
                     </li>
                     <li class="ktsnpl-block__item">
                        Гибкость в реализации алгоритмов: модули обработки аналоговых сигналов могут быть переконфигурированы на
                        объекте, например, при смене типа датчика путём перезаписи энергонезависимой памяти. Простая возможность
                        перекоммутации связей между модулями позволяет менять алгоритмы прямо на объекте
                     </li>
                     <li class="ktsnpl-block__item">
                        Проектирование алгоритмов осуществляется в графической форме с помощью системы автоматизированного
                        проектирования (САПР). Результат проектирования – состав модулей и связей между ними (но не загружаемый
                        код, как в случае программируемых систем).
                     </li>
                     <li class="ktsnpl-block__item">
                        Высокая степень информатизации реализована за счёт наличия встроенной дублированной информационной сети.
                        Сетевая часть выполнена программируемой, при этом влияние программируемых средств на «жёсткую» логику
                        исключено схемотехнически при любых сбоях программируемой части, включая её физический отказ.
                     </li>
                     <li class="ktsnpl-block__item">
                        Возможность построения многоканальных распределённых систем за счёт передачи сигналов по оптоволоконным
                        сетям, также реализованным на «жёсткой» логике.
                     </li>
                     <li class="ktsnpl-block__item">
                        Система покаскадной самодиагностики (опробования), реализованная также на «жёсткой» логике, интегрирована
                        в оборудование.
                     </li>
                     <li class="ktsnpl-block__item">
                        Компактность оборудования достигается за счёт применения современных электронных компонентов в
                        микроминиатюрном исполнении.
                     </li>
                  </ul>
               </div>

               <img src="img/ktsnpl-1.png" alt="" class="ktsnpl-block__img" />
            </div>

            <div class="ktsnpl-block">
               <div class="ktsnpl-text ktsnpl-text-nb">
                  <p class="ktsnpl-block__text">
                     Недостатки программируемого оборудования удалось <span class="accent">преодолеть</span>:
                  </p>
                  <ul class="ktsnpl-block__list">
                     <li class="ktsnpl-block__item">
                        Полностью устранена зависимость алгоритмов управления от программных ошибок и сбоев – программное
                        обеспечение не вмешивается в процесс управления.
                     </li>
                     <li class="ktsnpl-block__item">
                        Технические средства выполнены на простых микросхемах стандартной логики, поддаются детальному анализу на
                        этапе разработки и глубокому диагностированию во время эксплуатации. Поведение аппаратуры остаётся
                        предсказуемым даже при появлении неисправностей.
                     </li>

                     <li class="ktsnpl-block__item">«<b>Жёсткая</b>» логика принципиально неуязвима для киберугроз.</li>
                  </ul>
                  <p class="ktsnpl-block__text">
                     <br />
                     Кроме того, особое внимание уделено помехозащищённости и сейсмостойкости оборудования (реализована группа
                     исполнения IV по <b>ГОСТ 32137-2013</b> и бесперебойная работу во время и после воздействия помех).
                     <br /><br />
                     Системы на «жёсткой» логике являются доверенными: <br />
                     <b
                        >они предсказуемы и проверяемы, не зависят от ошибок программистов и киберугроз, продолжают работать при
                        полном отказе программируемых систем.
                     </b>
                  </p>
               </div>

               <img src="img/ktsnpl-2.png" alt="" class="ktsnpl-block__img" />
            </div>
            <p class="contacts-question"><b>Остались вопросы?</b></p>
            <button class="contacts-button">Связаться с нами</button>
         </div>
      </section>
      <?php include ('footer.php'); ?>