<?php include ('header.php'); ?>
  <section class="socrespons">
    <div class="container">
      <h2 class="socrespons-title">Компания</h2>
      <h3 class="socrespons-subtitle">Социальная ответственность</h3>
      <div class="socrespons-block">
        <p class="socrespons-block__text"><b>Система управления охраной труда</b> – комплекс взаимосвязанных и взаимодействующих между собой элементов, устанавливающих политику и цели в области охраны труда у конкретного работодателя и процедуры по достижению этих целей.
            <br><br>
          <b>Для ООО “Московский завод” </b><span class="accent">«ФИЗПРИБОР»</span>,  создание и поддержание оптимальных условий труда, при которых воздействие вредных и/или опасных производственных факторов либо отсутствует вовсе, либо уровень такого воздействия не превышают значений, установленные действующими нормативами и принятые в качестве безопасных для человека является приоритетной задачей.
        </p>
        <img src="img/socrespons.png" alt="" class="socrespons-block__img">
      </div>
    </div>
  </section>
<?php include ('footer.php'); ?>